In [2]:
import pandas as pd
import numpy as np

In [3]:
C = [1, 2, 3, np.NaN]
D = [4, 5, 6, np.NaN]
E = [7, 8, np.NaN, np.NaN]
F = {'C': C , 'D': D, 'E':E}
dfn = pd.DataFrame(F)
dfn

     C    D    E
0  1.0  4.0  7.0
1  2.0  5.0  8.0
2  3.0  6.0  NaN
3  NaN  NaN  NaN

In [4]:
x = 0
def fun(ser):
    global x
    x = len(ser)
    print(x)
    return ser

In [6]:
dfn['C'].pipe(fun).count()

4

3

In [16]:
def ren_in(index):
    return index+1

In [18]:
col_map = {'C':'CopyC'}

dfn.rename(columns={'C':'CopyC'}, index=ren_in)

   CopyC    D    E
1    1.0  4.0  7.0
2    2.0  5.0  8.0
3    3.0  6.0  NaN
4    NaN  NaN  NaN

In [19]:
dfn.D

0    4.0
1    5.0
2    6.0
3    NaN
Name: D, dtype: float64

In [28]:

dfn['F'] = 0
dfn['F'] = dfn['C']+dfn['D']
dfn

     C    D    E    F
0  1.0  4.0  7.0  5.0
1  2.0  5.0  8.0  7.0
2  3.0  6.0  NaN  9.0
3  NaN  NaN  NaN  NaN

In [29]:
dfn['N'] = [1,2]

ValueError: Length of values (2) does not match length of index (4)

In [34]:
# dfn.drop('F')
dfn.drop('F', axis=1, inplace=True)

In [35]:
dfn.assign(f=0)

     C    D    E  f
0  1.0  4.0  7.0  0
1  2.0  5.0  8.0  0
2  3.0  6.0  NaN  0
3  NaN  NaN  NaN  0

In [43]:
dfn[['C', 'D']]

     C    D
0  1.0  4.0
1  2.0  5.0
2  3.0  6.0
3  NaN  NaN

In [44]:
dfn.loc[1:2, 'C':'E']

     C    D    E
1  2.0  5.0  8.0
2  3.0  6.0  NaN

In [46]:
dfn.iloc[0:2, 0:2]

     C    D
0  1.0  4.0
1  2.0  5.0

In [47]:
dfn.loc[:, dfn.columns[1:3]]

     D    E
0  4.0  7.0
1  5.0  8.0
2  6.0  NaN
3  NaN  NaN

In [50]:
dfn.select_dtypes(include=float)

     C    D    E
0  1.0  4.0  7.0
1  2.0  5.0  8.0
2  3.0  6.0  NaN
3  NaN  NaN  NaN

In [52]:
dfn.filter(like='C')

     C
0  1.0
1  2.0
2  3.0
3  NaN

In [54]:
dfn.filter(items=['D', 'E'])

     D    E
0  4.0  7.0
1  5.0  8.0
2  6.0  NaN
3  NaN  NaN

In [64]:
dfn.filter(regex='/d')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [66]:
dfn.to_csv('PandasClass02CSV.csv', index=False)

In [67]:
dfSer = dfn['C']
dfSer

0    1.0
1    2.0
2    3.0
3    NaN
Name: C, dtype: float64

In [68]:
dfSer.unique()

array([ 1.,  2.,  3., nan])

In [69]:
dfSer.nunique()

3

In [9]:
dfn.nlargest(2,'C').nsmallest(1, 'D')

     C    D    E
1  2.0  5.0  8.0

In [13]:
(
dfn.sort_values('C', ascending=False).head(2)
    .sort_values("D").head(1)
)

     C    D    E
1  2.0  5.0  8.0

In [14]:
dfn

     C    D    E
0  1.0  4.0  7.0
1  2.0  5.0  8.0
2  3.0  6.0  NaN
3  NaN  NaN  NaN

In [25]:
d_creteria = dfn['D'] > 4
e_creteria = dfn['E'].notna()
final_criteria = d_creteria & e_creteria

In [26]:
dfn.loc[d_creteria & e_creteria, 'E']

1    8.0
Name: E, dtype: float64

In [23]:
dfn['C'].isin([4, 1])

0     True
1    False
2    False
3    False
Name: C, dtype: bool

In [24]:
dfn['C'].between(1,2)

0     True
1     True
2    False
3    False
Name: C, dtype: bool

In [40]:
qs =(
    "D > 4"
    " and E in @depts"
)

dfn.query(qs)

     C    D    E
1  2.0  5.0  8.0
2  3.0  6.0  NaN